---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures
source: html/e15e1f45-d979-e71f-c15a-d6a6f94cb12d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures

Failures related to structural materials.

## Syntax (C#)
```csharp
public static class StructuralAssetFailures
```